#language: ru
@tree
@ExportScenarios
@IgnoreOnCIMainBuild


Функционал: одинаковые блоки шагов

Как Тестировщик я хочу
создать экспортные сценарии на одинаковые блоки шагов
чтобы не дублировать части сценариев

@ТипШага: Инициатор данных
@Описание: обновление характеристик
@ПримерИспользования: Когда обновление характеристик
Сценарий: обновление характеристик
    Дано Я открываю навигационную ссылку "e1cib/list/Catalog.ItemKeys"
    И я нажимаю на кнопку "Обновить наименования характеристик"
    И Пауза 5
    И я закрываю все окна клиентского приложения