#language: ru

@tree

Функционал: Создание документа Заказ

Как Менеджер по продажам я хочу
выполнить создание документа Заказ
чтобы вести учет заказов

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание документа Заказ
* Открытие формы создания документа
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение шапки документа
	И я заполняю шапку документа Заказ
* Проверка шапки документа
	И реквизиты формы имеют значение:
		| 'Имя'                  | 'Значение'                    | 'КакИскать' |
		| 'Валюта'               | 'Рубли'                       | ''          |
		| 'ВидЦен'               | 'Мелкооптовая'                | ''          |
		| 'Организация'          | 'ООО \"Товары\"'              | ''          |
		| 'Покупатель'           | 'Магазин \"Бытовая техника\"' | ''          |
		| 'Склад'                | 'Склад отдела продаж'         | ''          |
		| 'СостояниеЗаказа'      | 'Открыт'                      | ''          |
* Заполнение товарной части
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Тайфун-12'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '3'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И я нажимаю на кнопку с именем 'ФормаСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000018' | 'Bosch15'      |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '5'
	И в таблице "Товары" я завершаю редактирование строки
* Проверка заполнения Суммы (итог)
	И элемент формы с именем "ТоварыИтогКоличество" стал равен '8'
	И элемент формы с именем "ТоварыИтогСумма" стал равен '40 000'
	И я нажимаю на кнопку "Записать"
* Номер
	И я запоминаю значение поля "Номер" как "$Номер$"
* Проведение документа
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Заказ (создание) *' в течение 20 секунд
* Проверка создания документа
	И таблица "Список" содержит строки:
		| 'Номер'   |
		| '$Номер$' |
